Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/court_offices/district_court_office.html.txt.tmx
Source language: en
Languages: ga

source: There are District Court offices throughout Ireland
ga: Tá oifig cúirte dúiche le fáil ar fud na tíre

source: The District Court office
ga: Oifig na Cúirte Dúiche

source: • issues all summonses, which initiate proceedings in criminal cases
ga: • Seolann amach gach toghairm a chuireann tús le gach cás coiriúla

source: • issues and processes proceedings in family law and civil cases
ga: • Seolann amach agus cuireann tús le gach a bhaineann le cásanna dlí clainne agus cásanna siabhalta

source: • prepares the list of cases for court
ga: • Réitíonn liosta cásanna don chúirt

source: • records the Orders of the Court
ga: • Tógann cúntas de ordaithe na Cúirte

source: • issues warrants to enforce the Orders of the Court
ga: • Eisíonn barántais chun Ordaithe na Cúirte a chur i bhfeidhm

source: • prepares all Court Orders
ga: • Ullmhaíonn gach Ordú Cúirte

source: • processes appeal documents for forwarding to the Circuit Court
ga: • Déanann próiseáil ar doiciméidí sula dtéann said ar aghaidh chuig an Chúirt Chuarda

source: • collects and transmits maintenance in family law cases
ga: • Bailíonn agus seolann ar aghaidh liúntas cothaithe i gcásanna dlí clainne

source: • receives and accounts for all monies lodged as bail
ga: • Glacann agus coiméadann cúntas ar airgead a thagann isteach do bhannaí

source: • operates the Small Claims procedure
ga: • Oibríonn an córas mhionéileamh
